Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: གོང་མ་བཞིན་དུ་སྦྱར་ཏེ། དགེ་བ་དང་མི་དགེ་བའི་ལས་ཀྱི་ལམ་གསུམ་པོ་དེ་དག་བསྟན་པ་དེ་བཞིན་དུ་མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཐམས་ཅད་ལའང་བྱའོ། ། གང་བརྫུན་དུ་སྨྲ་བ་དེས་སྐུར་པ་ཐོབ་པར་མི་འགྱུར་བ་དེ་ནི་གནས་མ་ཡིན་ནོ། ། གང་ཐོབ་པར་འགྱུར་བ་དེ་ནི་གནས་སོ། ། གང་བརྫུན་དུ་སྨྲ་བ་སྤངས་པས་སྐུར་པ་ཐོབ་པར་འགྱུར་བ་དེ་ནི་གནས་མ་ཡིན་ནོ། ། གང་ཐོབ་པར་མི་འགྱུར་བ་དེ་ནི་གནས་སོ། ། གང་ཕྲ་མ་ཟེར་བས་མི་ཕྱེད་པའི་གཡོག་རྙེད་པ་དེ་ནི་གནས་མ་ཡིན་ནོ། ། གང་རྙེད་པར་མི་འགྱུར་བ་དེ་ནི་གནས་སོ། ། གང་ཕྲ་མ་སྤངས་པའི་གཡོག་ཕྱེད་པར་འགྱུར་བ་དེ་ནི་གནས་མ་ཡིན་ནོ། ། གང་གཡོག་མི་ཕྱེད་པ་རྙེད་པ་དེ་ནི་གནས་སོ། ། གང་ཚིག་རྩུབ་པོ་སྨྲ་བས་རྟག་པར་ཡིད་དུ་འོང་བ་ཐོས་པར་འགྱུར་བ་དེ་ནི་གནས་མ་ཡིན་ནོ། ། གང་ཡིད་དུ་མི་འོང་བ་ཐོས་པར་འགྱུར་བ་དེ་ནི་གནས་སོ། །གང་ཚིག་རྩུབ་པོ་སྤངས་པས་ཡིད་དུ་མི་འོང་བ་ཐོས་པར་འགྱུར་བ་དེ་ནི་གནས་མ་ཡིན་ནོ། ། གང་ཡིད་དུ་འོང་བ་ཐོས་པར་འགྱུར་བ་དེ་ནི་གནས་སོ། ། གང་ཚིག་ཀྱལ་པ་སྨྲ་བས་ཤིན་ཏུ་གདོན་མི་ཟ་བའི་སྤོབས་པར་འགྱུར་བ་ནི་གནས་མ་ཡིན་ནོ། ། གང་མི་འགྱུར་བ་དེ་ནི་གནས་སོ། ། གང་ཀྱལ་པར་སྨྲ་བ་སྤངས་པས་ཤིན་ཏུ་གདོན་མི་ཟ་བའི་སྤོབས་པར་མི་འགྱུར་བ་ནི་གནས་མ་ཡིན་ནོ། ། གང་ཤིན་ཏུ་གདོན་མི་ཟ་བའི་སྤོབས་པར་འགྱུར་བ་ནི་གནས་སོ། ། གང་བརྣབ་སེམས་ཅན་ལོངས་སྤྱོད་རབ་ཏུ་ཉམས་པར་མི་འགྱུར་བ་ནི་གནས་མ་ཡིན་ནོ། ། གང་འགྱུར་བ་ནི་གནས་སོ། ། གང་བརྣབ་སེམས་སྤངས་པ་ལོངས་སྤྱོད་རབ་ཏུ་ཉམས་པར་འགྱུར་བ་ནི་གནས་མ་ཡིན་ནོ། ། གང་མི་འགྱུར་བ་ནི་གནས་སོ། ། གང་གནོད་སེམས་ཅན་སེམས་ཅན་དམྱལ་བར་མི་འགྲོ་བ་ནི་གནས་མ་ཡིན་ནོ། ། གང་འགྲོ་བ་ནི་གནས་སོ། ། གང་གནོད་སེམས་སྤངས་པ་བདེ་འགྲོ་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་མི་འགྲོ་བ་དེ་ནི་གནས་མ་ཡིན་ནོ། ། གང་འགྲོ་བ་ནི་གནས་སོ། །
en: “It is exactly the same with all ten unwholesome acts as it is with the three pairs of wholesome and unwholesome acts that have already been mentioned. It is not possible that lying will not lead to having to endure false accusations. It will. It is not possible that avoiding lying will lead to having to endure false accusations. It will not. It is not possible that slander will lead to harmony among those who are close to you. It will not. It is not possible that avoiding slander will create disharmony among those who are close to you. It will lead to harmony among those who are close to you. It is not possible that if one uses harsh words, one will always hear pleasant things. One will hear unpleasant things. It is not possible that when one avoids harsh words, one will hear unpleasant things. One will hear pleasant things. It is not possible that inane chatter will lead to confident eloquence. It will not. It is not possible that avoiding inane chatter will fail to lead to confident eloquence. It will lead to confident eloquence. It is not possible that covetousness will fail to result in the destruction of one’s fortune. It will. It is not possible that avoiding covetousness will result in the destruction of one’s fortune. It will not. It is not possible that malice will not lead to the hell realms. It will. It is not possible that avoiding malice will not lead to a fortunate existence in a heavenly realm. It will.

source: ཤཱ་རིའི་བུ་གནས་མ་ཡིན་ཞིང་སྐབས་མེད་དེ། གང་ལོག་པར་ལྟ་བའི་སྐྱེས་བུ་གང་ཟག་ལོག་པར་ལྟ་བ་བཟུང་བའི་རྒྱུར་ལམ་རྙེད་པར་འགྱུར་བ་དེ་ནི་གནས་མ་ཡིན་ནོ། ། ཡང་ཤཱ་རིའི་བུ་གང་ལོག་པར་ལྟ་བའི་སྐྱེས་བུ་གང་ཟག་ལོག་པར་ལྟ་བ་བཟུང་བའི་རྒྱུས་ལམ་མི་རྙེད་པ་ནི་གནས་ཡིན་ཏེ་སྐབས་ཡོད་དོ། ། ཤཱ་རིའི་བུ་གང་ཡང་དག་པར་ལྟ་བའི་སྐྱེས་བུ་གང་ཟག་ཡང་དག་པར་ལྟ་བ་བཟུང་བའི་རྒྱུས་འཕགས་པའི་ལམ་མི་རྙེད་པ་དེ་ནི་གནས་མ་ཡིན་ཏེ་སྐབས་མེད་དོ། ། ཡང་ཤཱ་རིའི་བུ་ཡང་དག་པར་ལྟ་བའི་སྐྱེས་བུ་གང་ཟག་ཡང་དག་པར་ལྟ་བ་བཟུང་བའི་རྒྱུས་འཕགས་པའི་ལམ་རྙེད་པ་དེ་ནི་གནས་ཡིན་ཏེ་སྐབས་ཡོད་དོ། །
en: “Śāriputra, it is not possible that a person who entertains wrong views will encounter the path because of the wrong views he holds. This is what is impossible. Śāriputra, a person who entertains wrong views will not encounter the path because of the wrong views he holds. Śāriputra, it is not possible that a person with right views will fail to encounter the noble path because of the right views he holds. This is what is impossible. Śāriputra, a person with right views will encounter the noble path because of the right views he holds.

source: གང་མཚམས་མེད་པ་བྱེད་པའི་སེམས་གནས་པར་འགྱུར་བ་ནི་གནས་མ་ཡིན་ནོ། ། གང་མི་འགྱུར་བ་ནི་གནས་སོ། ། གང་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པའི་སེམས་གནས་པར་མི་འགྱུར་བ་ནི་གནས་མ་ཡིན་ནོ། ། གང་འགྱུར་བ་ནི་གནས་སོ། ། གང་དམིགས་པར་ལྟ་བའི་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་འཐོབ་པ་དེ་ནི་གནས་མ་ཡིན་ནོ། ། གང་འཐོབ་པར་འགྱུར་བ་ནི་གནས་སོ། ། གང་སྟོང་པ་ཉིད་ལ་མོས་པས་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་མི་འཐོབ་པ་ནི་གནས་མ་ཡིན་ནོ། ། གང་འཐོབ་པར་འགྱུར་བ་ནི་གནས་སོ། ། གང་འགྱོད་པ་ལ་གནས་པའི་སེམས་ཤིན་ཏུ་བྱང་བ་རྗེས་སུ་འཐོབ་པར་འགྱུར་བ་ནི་གནས་མ་ཡིན་ནོ། ། གང་མི་འཐོབ་པ་ནི་གནས་སོ། ། གང་ཀུན་ཏུ་དཀྲིས་ཏེ་འདུག་པའི་སེམས་ལས་སེམས་ཤིན་ཏུ་བྱང་བར་འགྱུར་བ་ནི་གནས་མ་ཡིན་ནོ། ། གང་མི་འགྱུར་བ་ནི་གནས་སོ། ། གང་བུད་མེད་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར་བ་ནི་གནས་མ་ཡིན་ནོ། ། གང་སྐྱེས་བུ་འགྱུར་བ་ནི་གནས་སོ། ། གང་བུད་མེད་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དུ་འགྱུར་བ་ནི་གནས་མ་ཡིན་ནོ། ། གང་སྐྱེས་བུ་འགྱུར་བ་ནི་གནས་སོ། ། གང་བུད་མེད་ཚངས་པ་དབང་བྱེད་དུ་འགྱུར་བ་ནི་གནས་མ་ཡིན་ནོ། ། གང་སྐྱེས་བུ་འགྱུར་བ་ནི་གནས་སོ། ། གང་བུད་མེད་སངས་རྒྱས་སུ་འཇིག་རྟེན་དུ་འབྱུང་བ་ནི་གནས་མ་ཡིན་ནོ། ། གང་བུད་མེད་ཀྱི་ལུས་བསྒྱུར་ནས་སངས་རྒྱས་སུ་འཇིག་རྟེན་དུ་འབྱུང་བ་ནི་གནས་སོ། ། གང་སྐྱེས་བུ་གང་ཟག་བརྒྱད་པ་འབྲས་བུ་མ་ཐོབ་པར་ལྡང་བ་ནི་གནས་མ་ཡིན་ནོ། ། གང་འབྲས་བུ་ཐོབ་ནས་ལྡང་བ་ནི་གནས་སོ། ། གང་རྒྱུན་ཏུ་ཞུགས་པ་སྲིད་པ་བརྒྱད་པ་མངོན་པར་སྒྲུབ་པ་ནི་གནས་མ་ཡིན་ནོ། ། གང་ཕུང་པོ་དེ་ཉིད་ཀྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་ནི་གནས་སོ། ། གང་ལན་ཅིག་ཕྱིར་འོང་བ་སྲིད་པ་གསུམ་པ་མངོན་པར་སྒྲུབ་པ་ནི་གནས་མ་ཡིན་ནོ། ། གང་ཕུང་པོ་དེ་ཉིད་ཀྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་ནི་གནས་སོ། ། གང་ཕྱིར་མི་འོང་བ་འཇིག་རྟེན་འདིར་འོང་བ་ནི་གནས་མ་ཡིན་ནོ། ། གང་དེ་ཉིད་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་ནི་གནས་སོ། ། གང་དགྲ་བཅོམ་པ་མཚམས་སྦྱོར་བའི་གནས་སུ་འགྱུར་བ་ནི་གནས་མ་ཡིན་ནོ། ། གང་མི་འགྱུར་བ་ནི་གནས་སོ། ། གང་འཕགས་པའི་གང་ཟག་སྟོན་པ་གཞན་ཚོལ་བའམ། རྒྱལ་མཚན་གཞན་བཟུང་ནས་སྤྱོད་པ་ནི་གནས་མ་ཡིན་ནོ། ། ལྷ་གཞན་མེད་པར་འགྱུར་བ་ནི་གནས་སོ། ། གང་མི་སྐྱེ་བ་ལ་བཟོད་པ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཕྱིར་ལྡོག་པ་ནི་གནས་མ་ཡིན་ནོ། ། གང་བྱང་ཆུབ་རྗེས་སུ་ཐོབ་པར་འགྱུར་བ་ནི་གནས་སོ། ། གནས་མ་ཡིན་ཞིང་སྐབས་མེད་དེ། གང་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་ནས་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་པར་ལྡང་བ་དེ་ནི་གནས་མ་ཡིན་ནོ། ། གང་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་ནས་ བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ལྡང་བ་དེ་ནི་གནས་ཡིན་ཏེ་ སྐབས་ཡོད་དོ། །
en: “It is not possible that the mind of one who has performed any of the acts with immediate results will be at ease. It will not. It is not possible that the mind of one whose conduct is morally pure will not be at ease. It will. It is not possible that someone with an ingrained tendency to trust his perceptions will possess patient acceptance. He will not. It is not possible that someone with a natural inclination toward emptiness will lack patient acceptance. He will not. It is not possible that someone who is burdened with a guilty conscience will attain mental clarity. He will not. It is not possible that someone whose mind is preoccupied will attain mental clarity. He will not. It is not possible that a king of the entire world will be female. He will be male. It is not possible that Indra, the mightiest of the gods, might be female. He will be male. It is not possible that the sovereign Brahmā will be female. He will be male. It is not possible that a woman will appear in the world as a buddha. She will appear in the world as a buddha after her sex has changed. It is not possible that a person on the eighth-lowest stage will move on without having attained fruition. He will move on when fruition has been attained. It is not possible that a stream enterer will have actualized an eighth existence. He will attain nirvāṇa by means of the wholesome skandhas. It is not possible that a once-returner will have actualized a third existence. He will have attained nirvāṇa by means of the wholesome skandhas. It is not possible that a non-returner will return to this realm. He will transcend his present state. It is not possible that an arhat will have any basis for the fetters. He will not. It is not possible that a noble being will seek out another teacher or that he will act under a different banner. He will have no other god. It is not possible that a bodhisatva who has attained patient acceptance of nonarising will regress. He will attain awakening. It is not possible that having sat down on the seat of awakening he will arise without having attained full and complete awakening. This is what is impossible. It is, however, possible that the bodhisatva who has sat down on the seat of awakening will, through complete realization, attain to unsurpassed perfect complete awakening.

source: ཤཱ་རིའི་བུ་གནས་མ་ཡིན་ཞིང་སྐབས་མེད་དེ། གང་དེ་བཞིན་གཤེགས་པ་ལ་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་སྣང་བ་དེ་ནི་གནས་མ་ཡིན་ནོ། ། གང་ཡང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱིས་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཐམས་ཅད་ཡང་དག་པར་བཅོམ་པ་ནི་གནས་ཡིན་ཏེ་སྐབས་ཡོད་དོ། ། ཤཱ་རིའི་བུ་གང་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཐོགས་པར་འགྱུར་བ་དེ་ནི་གནས་མ་ཡིན་ཏེ་སྐབས་མེད་དོ། ། གང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཡེ་ཤེས་ཐོགས་པ་མེད་པ་ནི་གནས་ཡིན་ཏེ་སྐབས་ཡོད་དོ། ། ཤཱ་རིའི་བུ་གནས་མ་ཡིན་ཞིང་སྐབས་མེད་དེ། གང་དེ་བཞིན་གཤེགས་པའི་གཙུག་ཏོར་ལ་ལས་བལྟར་མཐོང་བ་དེ་ནི་གནས་མ་ཡིན་ནོ། ། གང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་གཙུག་ཏོར་ལྟར་མི་མཐོང་བ་ནི་གནས་ཡིན་ཏེ་སྐབས་ཡོད་དོ། ། ཤཱ་རིའི་བུ་གནས་མ་ཡིན་ཞིང་སྐབས་མེད་དེ། དེ་བཞིན་གཤེགས་པའི་སེམས་དང་སྤྱོད་པ་སྣང་བ་ནི་གནས་མ་ཡིན་ནོ། ། ཡང་ཤཱ་རིའི་བུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་སེམས་དང་སྤྱོད་པ་མི་སྣང་བ་ནི་གནས་ཡིན་ཏེ་སྐབས་ཡོད་དོ། ། ཤཱ་རིའི་བུ་གནས་མ་ཡིན་ཞིང་སྐབས་མེད་དེ། གང་དེ་བཞིན་གཤེགས་པ་ལ་མཉམ་པར་མ་བཞག་པའི་སེམས་དམིགས་པར་འགྱུར་བ་དེ་ནི་གནས་མ་ཡིན་ནོ། ། ཡང་ཤཱ་རིའི་བུ་གང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་མཉམ་པར་བཞག་པ་ནི་གནས་ཡིན་ཏེ་སྐབས་ཡོད་དོ། ། ཤཱ་རིའི་བུ་གནས་མ་ཡིན་ཞིང་སྐབས་མེད་དེ། གང་དེ་བཞིན་གཤེགས་པ་ལ་མི་བདེན་པའི་ཚིག་འབྱུང་བ་དེ་ནི་གནས་མ་ཡིན་ནོ། ། གང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལོག་པར་མི་གསུང་ཞིང་གཞན་མ་ཡིན་པར་གསུང་བ་ནི་གནས་ཡིན་ཏེ་སྐབས་ཡོད་དོ། ། ཤཱ་རིའི་བུ་གནས་མ་ཡིན་ཞིང་སྐབས་མེད་དེ། གང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་འཁྲུལ་པ་དམིགས་པར་འགྱུར་བ་དེ་ནི་གནས་མ་ཡིན་ནོ། ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་འཁྲུལ་པ་མེད་དེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཚིག་མི་འཁྲུལ་པ་ནི་གནས་ཡིན་ཏེ་སྐབས་ཡོད་དོ། ། དེ་བཞིན་དུ་མི་འཇིགས་པ་བཞི་དང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅོ་བརྒྱད་རྣམས་རྒྱས་པར་བྱ་སྟེ།
en: “Śāriputra, it is not possible that a tathāgata will have any remaining habitual tendencies. This is what is impossible. The lords, the buddhas, will have eliminated all traces of previous actions. Śāriputra, it is not possible that a tathāgata’s knowledge will be limited in any way. The knowledge of the lords, the buddhas, will be unlimited. Śāriputra, it is not possible that anyone can behold the crown protrusion of a tathāgata. This is what is impossible. The crown protrusions of the lords, the buddhas, are invisible. Śāriputra, it is not possible that the state of a tathāgata’s mind can be discerned. This is what is impossible. Śāriputra, the states of mind of the lords, the buddhas, are unknowable. Śāriputra, it is not possible that the mind of a tathāgata can be seen to be uncomposed. This is what is impossible. Śāriputra, the lords, the buddhas, are always composed. Śāriputra, it is not possible that a tathāgata may utter an untruth. This is what is impossible. The lords, the buddhas, do not speak untruths and do not speak inconsistently. Śāriputra, it is not possible that the lords, the buddhas, make mistakes. This is what is impossible. The lords, the buddhas, make no mistakes, and the words of the lords, the buddhas, are unmistaken. It is the same with the four kinds of confidence all the way up to the eighteen unique buddha qualities.

source: ཤཱ་རིའི་བུ་གནས་མ་ཡིན་ཞིང་སྐབས་མེད་དེ། གང་དེ་བཞིན་གཤེགས་པ་ད་ལྟར་བྱུང་བའི་དུས་ལ་ཆགས་པ་དང་། སྒྲིབ་པར་བཅས་པའི་ཡེ་ཤེས་གཟིགས་པ་འཇུག་པའི་བར་དུ་དེ་ནི་གནས་མ་ཡིན་ནོ། ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ད་ལྟར་གྱི་དུས་ལ་ཆགས་པ་མེད་ཅིང་སྒྲིབ་པ་མེད་པའི་ཡེ་ཤེས་མཐོང་བ་འཇུག་པ་ནི་གནས་ཡིན་ཏེ་སྐབས་ཡོད་དོ། ། དེ་ལྟར་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་གནས་དང་གནས་མ་ཡིན་པ་མཁྱེན་པའི་སྟོབས་མཐའ་ཡས་མུ་མེད་དོ། ། འདི་ལྟར་ཤཱ་རིའི་བུ་དེ་བས་ན་དེ་བཞིན་གཤེགས་པའི་གནས་དང་། གནས་མ་ཡིན་པ་མཁྱེན་པའི་སྟོབས་མཐའ་ཡས་མུ་མེད་དེ། །་
en: Śāriputra, it is not possible that there could be anything that could obstruct or confuse the vision of the knowledge of the lords, the buddhas, in relation to the present. This, Śāriputra, is because the Tathāgata’s power to know what is possible and what is impossible is completely boundless.

source: ཤཱ་རིའི་བུ་གང་ནམ་མཁའི་མཐའ་འདོད་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་གནས་དང་། གནས་མ་ཡིན་པ་མཁྱེན་པའི་སྟོབས་ཀྱི་མཐའ་འདོད་དོ། ། བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པའི་གནས་དང་གནས་མ་ཡིན་པ་མཁྱེན་པའི་སྟོབས་བསམ་གྱིས་མི་ཁྱབ་པ་དེ་ཐོས་ནས་མངོན་པར་དད། ཡིད་ཆེས། རབ་ཏུ་རྟོག ། སོམ་ཉི་མེད། ཐེ་ཚོམ་མི་ཟ། རྒྱ་ཆེར་དགའ་མགུ་སྟེ། རང་ས་པ་རྙེད་ནས་ངོ་མཚར་དང་། རྨད་དུ་འདུ་ཤེས་སྐྱེད་དོ། །
en: “Thus, Śāriputra, just as space is completely boundless, the Tathāgata’s power to know what is possible and what is impossible is completely boundless. Śāriputra, if one could claim that there is a limit to space, then one could also claim that there is a limit to the power of the tathāgata, arhat, fully accomplished Buddha to know what is possible and what is impossible. When the bodhisatva learns of this inconceivable power of the Tathāgata to know what is possible and what is impossible, he develops faith, trust, and confidence, and he has no uncertainty or doubt about it. This brings him pleasure, joy, and satisfaction, and he considers it to be truly wondrous and extraordinary.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ཏེ། བདེ་བར་གཤེགས་པས་དེ་སྐད་གསུངས་ནས་སྟོན་པ་ཡང་འདི་སྐད་གསུང་ངོ་། །
en: This is what the Lord said. After the Sugata had said this, he, the teacher, continued as follows:

source: ཇི་ལྟར་ཕྱོགས་བཅུའི་ནམ་མཁའ་ཚད་མེད་མཐའ་ཡས་པ། །དེ་བཞིན་རྒྱལ་བའི་གནས་དང་གནས་མིན་མཁྱེན་མཐའ་ཡས། །འགྲོ་བའི་གནས་དང་གནས་མིན་དེ་བཞིན་རབ་མཁྱེན་ནས། །
en: “Just as the heavens in the ten directions are infinite and immeasurable, The Victorious One’s knowledge of what is possible and what is impossible is limitless. The teacher truly knows what is possible and what is impossible in the world

source: སྟོན་པ་ཆོས་མཆོག་རྒྱ་ཆེན་ཡང་དག་རབ་ཏུ་འཆད། །
en: And proclaims the exalted, excellent Dharma according to this knowledge.

source: མི་གང་ཐར་པ་དག་གི་ལམ་གྱི་སྣོད་གྱུར་པ། །སྟོན་པས་དེ་དག་སྤྱོད་པ་མཁྱེན་ནས་ཆོས་ཀྱང་འཆད། །
en: “There are people who are fit to be vessels for the path of liberation. The teacher knows them by their conduct and so instructs them in the Dharma.

source: སེམས་ཅན་གང་དག་སྣོད་དུ་གྱུར་པ་མ་ཡིན་པ། །གནས་དང་གནས་མིན་རིག་ནས་དེ་དག་བཏང་སྙོམས་འཇོག། །
en: Then again there are beings who are not fit to be vessels. Neutral to them, he knows what is possible and impossible.

source: ནམ་མཁའ་འདི་གཡོས་ས་ལ་འབྲས་བུ་འབྱུང་ཡང་ནི། །བདེ་བར་གཤེགས་པའི་གནས་དང་གནས་མིན་གཞན་མི་འགྱུར། །
en: “Even if the sky were to collapse to the ground like falling fruit, The sugatas’ knowledge of what is possible and what is impossible would remain faultless.

source: འཇིག་རྟེན་པ་ལས་འཇིག་རྟེན་འདས་པ་སྟོབས་བཅུ་ལྡན། ། ཡོན་ཏན་མཆོག་འཆད་རྣམས་ཀྱི་ཡེ་ཤེས་བསམ་མི་ཁྱབ། །
en: Those who possess the ten powers, are beyond the common world, and have the very best of qualities Possess knowledge, and this knowledge is inconceivable.

source: ཤཱ་རིའི་བུ་འདི་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་པོ་སྟེ། སྟོབས་དེ་དང་ལྡན་པས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཁོར་གྱི་ནང་དུ་སེང་གེའི་སྒྲ་ཡང་དག་པར་སྒྲོག་སྟེ། ཁྱུ་མཆོག་གི་གནས་སུ་ཞལ་གྱིས་འཆེ་ཞིང་ཚངས་པའམ། བརྒྱ་བྱིན་ནམ། སུས་ཀྱང་འཇིག་རྟེན་དུ་ཆོས་དང་འཐུན་པར་མ་བསྐོར་བའི་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་སྐོར་བའི་བར་དུའོ། །
en: “This, Śāriputra, is the first of the tathāgatas’ tathāgata powers, and with this power the tathāgata, arhat, fully accomplished Buddha roars a true lion’s roar in the assembly, asserts the state of the supreme bull, and turns the holy wheel that no ascetic, brahmin, god, māra, or brahmā of this world has legitimately turned.

source: དེ་ལ་དེ་བཞིན་གཤེགས་པའི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་མཁྱེན་པའི་སྟོབས་གང་ཞེ་ན། འདི་ལ་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་བླ་ན་ མེད་པའི་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་ཀྱིས་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་ལས་ལེན་པ་རྣམས་ཀྱི་རྣམ་པར་སྨིན་པ་གནས་དང་། རྒྱུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ།། ཇི་ལྟར་རབ་ཏུ་མཁྱེན་ཅེ་ན། འདི་ལ་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་གང་འདས་པའི་ལས་ལེན་པ་དགེ་བའི་རྒྱུ་ལས་བྱུང་བ། མི་དགེ་བ་དང་བྲལ་བ། གང་མ་འོངས་པའི་དུས་ན་དགེ་བའི་རྒྱུ་འབྱིན་པ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། ། ལས་ལེན་པ་གང་མི་དགེ་བའི་རྒྱུ་ལས་བྱུང་བ། དགེ་བ་དང་བྲལ་བ་གང་མ་འོངས་པའི་དུས་ན་མི་དགེ་བའི་རྒྱུ་འབྱིན་པ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། ། ལས་ལེན་པ་གང་མ་འོངས་པའི་དུས་ན་དམན་པ་ལ་སྟེན་པར་འགྱུར་བ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། ། ལས་ལེན་པ་གང་ད་ལྟར་གྱི་དུས་ན་ཁྱད་པར་ལ་སྟེན་པར་འགྱུར་བ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། ། ལས་ལེན་པ་གང་ད་ལྟར་གྱི་དུས་ན་ཁྱད་པར་དུ་སྟེན་ལ་མ་འོངས་པའི་དུས་ན་དམན་པ་ལ་སྟེན་པར་འགྱུར་བ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། ། ལས་ལེན་པ་གང་ད་ལྟར་གྱི་དུས་ན་དམན་པ་ལ་སྟེན་ལ་མ་འོངས་པའི་དུས་ན་ཁྱད་པར་དུ་སྟེན་པར་འགྱུར་བ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། ། ལས་ལེན་པ་གང་ད་ལྟར་གྱི་དུས་ན་ཡང་དམན་པ་ལ་སྟེན་ལ་མ་འོངས་པའི་དུས་ན་ཡང་དམན་པ་ལ་སྟེན་པར་འགྱུར་བ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། ། ལས་ལེན་པ་གང་ད་ལྟར་གྱི་དུས་ན་ཡང་ཁྱད་པར་དུ་སྟེན་ལ་མ་འོངས་པའི་དུས་ན་ཡང་ཁྱད་པར་དུ་སྟེན་པར་འགྱུར་བ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། ། ལས་ལེན་པ་གང་འདས་པའི་དུས་ན་སྦྱོར་བ་དམན་ལ་མ་འོངས་པའི་དུས་ན་སྦྱོར་བ་རྒྱ་ཆེན་པོར་འགྱུར་བ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། ། ལས་ལེན་པ་གང་རྩོམ་པ་ཆུང་ལ་ཁྱད་པར་ཆེན་པོར་འགྱུར་བ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། ། ལས་ལེན་པ་གང་རྩོམ་པ་ཆེ་ལ་ཁྱད་པར་ཆུང་ངུར་འགྱུར་བ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། ། ལས་ལེན་པ་གང་ཉན་ཐོས་སུ་འགྱུར་བའི་རྒྱུ་འབྱིན་པ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། ། ལས་ལེན་པ་གང་རང་སངས་རྒྱས་ཀྱི་རྒྱུ་འབྱིན་པ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། ། ལས་ལེན་པ་གང་སངས་རྒྱས་སུ་འགྱུར་བའི་རྒྱུ་འབྱིན་པ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། ། ལས་ལེན་པ་གང་ད་ལྟར་སྡུག་བསྔལ་ལ་མ་འོངས་པའི་དུས་ན་རྣམ་པར་སྨིན་པ་བདེ་བ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། ། ལས་ལེན་པ་གང་ད་ལྟར་བདེ་ལ་མ་འོངས་པ་ན་རྣམ་པར་སྨིན་པ་སྡུག་བསྔལ་བ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། ། ལས་ལེན་པ་གང་ད་ལྟར་ཡང་སྡུག་བསྔལ་ལ་མ་འོངས་པ་ན་ཡང་རྣམ་པར་སྨིན་པ་སྡུག་བསྔལ་བ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། ། ལས་ལེན་པ་གང་ད་ལྟར་ཡང་བདེ་ལ། མ་འོངས་པ་ན་ཡང་རྣམ་པར་སྨིན་པ་བདེ་བ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “What does the Tathāgata’s power to know the ripening of the fruits of actions entail? Śāriputra, it means that with this unsurpassed tathāgata power of knowledge, the Tathāgata truly understands the ripening of the fruits of actions performed in the past, in the present, and in the future, in terms of both the causes and the situations involved. What does this knowledge consist of? Śāriputra, the tathāgata, arhat, fully accomplished Buddha knows that an action performed in the past that is a wholesome cause and without anything unwholesome will continue as a wholesome cause in the future. The Tathāgata knows that an action that is an unwholesome cause and without anything wholesome will continue as an unwholesome cause in the future. The Tathāgata knows which actions will lead to failure in the future. The Tathāgata knows which actions will lead to success in the future. The Tathāgata knows which actions lead to success in the present. The Tathāgata knows which actions lead to success in the present but to failure in the future. The Tathāgata knows which actions lead to failure in the present but to success in the future. The Tathāgata knows which actions lead to failure in the present and to failure in future. The Tathāgata knows which actions lead to success in the present and to success in the future. “The Tathāgata knows which actions result in failure in the present but will have excellent consequences in the future. The Tathāgata knows the actions where a small undertaking will bring great success. The Tathāgata knows the actions where a great undertaking will bring only limited success. The Tathāgata knows the actions that cause one to become a śrāvaka. The Tathāgata knows the actions that cause one to become a pratyekabuddha. The Tathāgata knows the actions that cause one to become a buddha. The Tathāgata knows the actions that bring suffering in the present but will ripen as happiness in the future. The Tathāgata knows the actions that bring happiness in the present but will ripen as suffering in the future. The Tathāgata knows the actions that bring suffering in the present and will ripen as suffering in the future. The Tathāgata knows the actions that bring happiness in the present and will ripen as happiness in the future.

source: འདི་ལྟར་ཤཱ་རིའི་བུ་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་གྱི་དུས་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལས་གང་དང་། རྒྱུ་གང་དང་། རྣམ་པར་སྨིན་པ་གང་དེ་བཞིན་དང་། དེ་བཞིན་ཉིད་དང་། གཞན་མ་ཡིན་པ་དང་། གཞན་མ་ཡིན་པར་སྟེན་པ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། ། མཁྱེན་ནས་ཀྱང་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་ཆོས་སྟོན་ཏོ། །
en: “In this way, Śāriputra, the Tathāgata knows exactly and unerringly the circumstances related to actions, causes, and the ripening of the fruits of actions in the past, present, and future of all sentient beings. Based on this knowledge, the Tathāgata then teaches the Dharma.

source: དེ་ལྟར་ན་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་གྱི་ལས་ལེན་པའི་རྒྱུ་གང་ཡིན་པ་དང་། གནས་གང་ཡིན་པ་དང་། རྣམ་པར་སྨིན་པ་མཁྱེན་པ་གང་ཡིན་པ་དེ་ནི་མཐའ་ཡས་མུ་མེད་དོ། ། འདི་ལྟ་སྟེ་དཔེར་ན་ཤཱ་རིའི་བུ་ནམ་མཁའ་མཐའ་ཡས་མུ་མེད་པ་དེ་བཞིན་དུ་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་མཁྱེན་པའི་སྟོབས་དེ་ཡང་མཐའ་ཡས་མུ་མེད་དོ། ། ཤཱ་རིའི་བུ་གང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་མཁྱེན་པའི་སྟོབས་ཀྱི་མཐའ་འདོད་པ་དེ་ནི་ནམ་མཁའི་མཐའ་འདོད་དོ། ། བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པའི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་མཁྱེན་པའི་སྟོབས་བསམ་གྱིས་མི་ཁྱབ་པ་དེ་ཐོས་ནས། མངོན་པར་དད། ཡིད་ཆེས། རབ་ཏུ་རྟོག ། སོམ་ཉི་མེད། ཐེ་ཚོམ་མི་ཟ། རྒྱ་ཆེར་དགའ་མགུ་སྟེ། རངས་པ་རྙེད་ནས་ནམ་མཁའ་ལྟ་བུར་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར་ངོ་མཚར་དང་རྨད་དུ་འདུ་ཤེས་སྐྱེད་དོ། །
en: “Śāriputra, the knowledge of the ripening of the fruits of actions possessed by the tathāgata, the arhat, the fully accomplished Buddha, his knowledge of the causes and underlying conditions involved, in the past, the present, and the future, is completely boundless. Thus, Śāriputra, just as space is completely boundless, in exactly the same way, Śāriputra, the Tathāgata’s power to know the ripening of the fruits of actions is completely boundless. Śāriputra, if it could be claimed that there is a limit to space, then it could also be claimed that there is a limit to the power of the tathāgata, arhat, fully accomplished Buddha to know the ripening of the fruits of actions. When the bodhisatva learns of this inconceivable power of the Tathāgata to know the ripening of the fruits of actions, he develops faith, trust, and confidence, and he has no uncertainty or doubt about it. This brings him pleasure, joy, and satisfaction, and as this power is as inconceivable as space, he considers it to be truly wondrous and extraordinary.”

source: འདི་ལ་ཆོས་ཉིད་ནི་འདི་ཡིན་ཏེ་དེ་ལ་འདི་སྐད་ཅེས་བྱའོ། །
en: This is the way things are, and concerning it the following verses were recited:

source: དེ་བཞིན་གཤེགས་པ་རྒྱུ་དང་སྨིན་ལ་མཁས། །
en: “The Tathāgata is versed in cause and ripening.

source: སྤྱན་ལྡན་ལས་རྣམས་ཀུན་གྱི་སྒྲུབ་པ་མཁྱེན། །
en: The seer knows the ways of all action.

source: དུས་གསུམ་ལ་ནི་རྒྱལ་བ་ཆགས་པ་མེད། །
en: There is nothing in the three times that limits the Victorious One.

source: སེམས་ཅན་ཀུན་གྱི་སྤྱོད་པ་རབ་ཏུ་མཁྱེན། །
en: He knows the activities of all sentient beings.

source: འགྲོ་བ་ལྔ་ཡི་སེམས་ཅན་ཐམས་ཅད་ཀྱི། །བདེ་དང་སྡུག་བསྔལ་རྒྱུར་ནི་གང་འགྱུར་དང་། །འཇུག་པ་གང་དག་སྡུག་བསྔལ་རྒྱུར་འགྱུར་བ། །དེ་དག་དེ་བཞིན་བདེ་གཤེགས་རབ་ཏུ་མཁྱེན། །
en: “The causes of suffering and happiness For all sentient beings in the five realms, And whatever may become a cause for suffering— All this the Sugata truly knows.

source: དཀར་ནག་ལས་རྣམས་ཀྱི་ནི་རྣམ་སྨིན་དང་། །རྒྱུ་དང་རྣམ་སྨིན་ཇི་ལྟར་འགྱུར་བ་ཡང་། །དེ་དག་དེ་བཞིན་བདེ་གཤེགས་རབ་མཁྱེན་ཏེ། །
en: “The ripening of black and white actions, And how the patterns of cause and ripening unfold— This the Sugata knows in precise detail,
